Documents/КредитныеИстории_ПодготовкаАдресовККорректировке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>КредитныеИстории_ПодготовкаАдресовККорректировке</Name>
			<Comment>для корректировки адресов, например, в событии 1.9</Comment>
			<BasedOn>
				<xr:Item>Document.НБКИДокументКорректировкаRUTDF</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.КредитныеИсторииСтруктураАдресаНаКорректировку</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидАдреса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КредитныеИсторииВидыАдресов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДолжникиДляКорректировкиАдресов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектДолжник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КредитныеИсторииСтруктураАдресаНаКорректировку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КредитныеИсторииСтруктураАдресаНаКорректировку</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСтраныОКСМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеИнойСтраны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерАдресаФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаселенныйПунктОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаселенныйПунктНазвание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Владение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Корпус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КвартираПомещениеОфис</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАдреса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КредитныеИсторииВидыАдресов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КредитныеИсторииСтруктураАдреса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КредитныеИсторииСтруктураАдреса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСтраныОКСМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеИнойСтраны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерАдресаФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаселенныйПунктОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаселенныйПунктНазвание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Владение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Корпус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КвартираПомещениеОфис</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАдреса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КредитныеИсторииВидыАдресов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/КредитныеИстории_ПодготовкаАдресовККорректировке/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НБКИДокументКорректировкаRUTDF") Тогда
		
		Для Каждого ТекСтрокатчКорректировка Из ДанныеЗаполнения.тчКорректировка Цикл
			НоваяСтрока = ДолжникиДляКорректировкиАдресов.Добавить();
			НоваяСтрока.ОбъектДолжник = ТекСтрокатчКорректировка.Должник;
		КонецЦикла;  
		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим) 
	
	Если Не ЗначениеЗаполнено(ВидАдреса) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Вид Адреса обязателен для заполнения!";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	Движения.КредитныеИсторииСтруктураАдресаНаКорректировку.Записывать = Истина;
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КредитныеИстории_ПодготовкаАдресовККорректировкеДолжникиДляКорректировкиАдресов.ОбъектДолжник КАК ОбъектДолжник
		|ПОМЕСТИТЬ ТЧДолжники
		|ИЗ
		|	Документ.КредитныеИстории_ПодготовкаАдресовККорректировке.ДолжникиДляКорректировкиАдресов КАК КредитныеИстории_ПодготовкаАдресовККорректировкеДолжникиДляКорректировкиАдресов
		|ГДЕ
		|	КредитныеИстории_ПодготовкаАдресовККорректировкеДолжникиДляКорректировкиАдресов.Ссылка = &Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектДолжник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧДолжники.ОбъектДолжник КАК Должник,
		|	КредитныеИсторииСтруктураАдреса.ВидАдреса КАК ВидАдреса,
		|	КредитныеИсторииСтруктураАдреса.Индекс КАК Индекс,
		|	КредитныеИсторииСтруктураАдреса.КодСтраныОКСМ КАК КодСтраныОКСМ,
		|	КредитныеИсторииСтруктураАдреса.НаименованиеИнойСтраны КАК НаименованиеИнойСтраны,
		|	КредитныеИсторииСтруктураАдреса.НомерАдресаФИАС КАК НомерАдресаФИАС,
		|	КредитныеИсторииСтруктураАдреса.НаселенныйПунктОКАТО КАК НаселенныйПунктОКАТО,
		|	КредитныеИсторииСтруктураАдреса.НаселенныйПунктНазвание КАК НаселенныйПунктНазвание,
		|	КредитныеИсторииСтруктураАдреса.Улица КАК Улица,
		|	КредитныеИсторииСтруктураАдреса.Дом КАК Дом,
		|	КредитныеИсторииСтруктураАдреса.Владение КАК Владение,
		|	КредитныеИсторииСтруктураАдреса.Корпус КАК Корпус,
		|	КредитныеИсторииСтруктураАдреса.Строение КАК Строение,
		|	КредитныеИсторииСтруктураАдреса.КвартираПомещениеОфис КАК КвартираПомещениеОфис
		|ИЗ
		|	ТЧДолжники КАК ТЧДолжники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КредитныеИсторииСтруктураАдреса КАК КредитныеИсторииСтруктураАдреса
		|		ПО ТЧДолжники.ОбъектДолжник = КредитныеИсторииСтруктураАдреса.Должник
		|ГДЕ
		|	КредитныеИсторииСтруктураАдреса.ВидАдреса = &ВидАдреса";
	
	Запрос.УстановитьПараметр("ВидАдреса", ВидАдреса);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Движение = Движения.КредитныеИсторииСтруктураАдресаНаКорректировку.Добавить(); 
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
		Движение.ВидАдреса = ВидАдреса; 
		Движение.Период = Дата;
		
	КонецЦикла;

КонецПроцедуры
